Certification/src/Catalogs/Консультации/Консультации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Консультации</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпонентыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКарточка</name>
    <type>
      <types>CatalogRef.Консультации</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СервисыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияКонсультаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сервисы</name>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>CatalogRef.Сервисы</types>
      </type>
    </attributes>
    <attributes>
      <name>Витрина</name>
      <type>
        <types>CatalogRef.Витрины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Компоненты</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.КомпонентыСервиса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутренняяПереписка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПоддержки</name>
      <type>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполненПеренос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Certification/src/Catalogs/ВидыБизнесСобытий/ВидыБизнесСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыБизнесСобытий</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВозобновлениеБизнесПроцесса</name>
      <description>Возобновление процесса</description>
    </items>
    <items>
      <name>ВходящийЗвонокОтПользователяСервиса</name>
      <description>Входящий звонок от пользователя сервиса</description>
    </items>
    <items>
      <name>ВыполнениеЗадачи</name>
      <description>Выполнение задачи</description>
    </items>
    <items>
      <name>ДобавленФайл</name>
      <description>Добавлен файл</description>
    </items>
    <items>
      <name>ЗавершениеБизнесПроцесса</name>
      <description>Завершение процесса</description>
    </items>
    <items>
      <name>ЗакрытиеОбращения</name>
      <description>Закрытие обращения</description>
    </items>
    <items>
      <name>ИзмененИнициаторОбращения</name>
      <description>Изменен инициатор обращения</description>
    </items>
    <items>
      <name>ИзменениеАктивнойПодпискиНаТариф</name>
      <description>Изменение активной подписки на тариф</description>
    </items>
    <items>
      <name>ИзменениеКонсультации</name>
      <description>Изменение консультации</description>
    </items>
    <items>
      <name>ИзменениеОбращения</name>
      <description>Изменение обращения</description>
    </items>
    <items>
      <name>ИзменениеОписанияОбращения</name>
      <description>Изменение описания обращения</description>
    </items>
    <items>
      <name>ИзменениеОшибки</name>
      <description>Изменение ошибки</description>
    </items>
    <items>
      <name>ИзменениеПожелания</name>
      <description>Изменение пожелания</description>
    </items>
    <items>
      <name>ИзменениеПринадлежностиОбращения</name>
      <description>Изменение принадлежности обращения</description>
    </items>
    <items>
      <name>ИзменениеСостоянияОбращения</name>
      <description>Изменение состояния обращения</description>
    </items>
    <items>
      <name>ИсходящийЗвонокПользователюСервиса</name>
      <description>Исходящий звонок пользователю сервиса</description>
    </items>
    <items>
      <name>НапоминаниеНеуспешнойЗагрузкиПочтыРарус</name>
      <description>Напоминание неуспешной загрузки почты (рарус)</description>
    </items>
    <items>
      <name>ОбращениеОтвязаноОтКарточкиБЗ</name>
      <description>Обращение отвязано от карточки БЗ</description>
    </items>
    <items>
      <name>ОбращениеПривязаноККарточкеБЗ</name>
      <description>Обращение привязано к карточке БЗ</description>
    </items>
    <items>
      <name>ОстановкаБизнесПроцесса</name>
      <description>Остановка процесса</description>
    </items>
    <items>
      <name>ОтправленоПисьмоПользователюСервиса</name>
      <description>Отправлен e-mail пользователю сервиса</description>
    </items>
    <items>
      <name>ОтправленКомментарийПользователю</name>
      <description>Отправлен комментарий пользователю</description>
    </items>
    <items>
      <name>ОтправленоОповещениеПоКонтролируемымСрокам</name>
      <description>Отправлено оповещение по контролируемым срокам</description>
    </items>
    <items>
      <name>ПеренаправлениеЗадачи</name>
      <description>Перенаправление задачи</description>
    </items>
    <items>
      <name>ПеренаправлениеКонсультации</name>
      <description>Перенаправление консультации</description>
    </items>
    <items>
      <name>ПеренаправлениеОбращения</name>
      <description>Перенаправление обращения</description>
    </items>
    <items>
      <name>ПеренаправлениеОшибки</name>
      <description>Перенаправление ошибки</description>
    </items>
    <items>
      <name>ПеренаправлениеПожелания</name>
      <description>Перенаправление пожелания</description>
    </items>
    <items>
      <name>ПовторноеОткрытиеОбращения</name>
      <description>Повторное открытие обращения</description>
    </items>
    <items>
      <name>ПолученКомментарийОтПользователя</name>
      <description>Получен комментарий от пользователя</description>
    </items>
    <items>
      <name>ПолученоПисьмоПоОбращению</name>
      <description>Получено письмо по обращению</description>
    </items>
    <items>
      <name>СозданиеЗадачи</name>
      <description>Создание задачи</description>
    </items>
    <items>
      <name>СозданиеКонсультации</name>
      <description>Создание консультации</description>
    </items>
    <items>
      <name>СозданиеОбращения</name>
      <description>Создание обращения</description>
    </items>
    <items>
      <name>СозданиеОшибки</name>
      <description>Создание ошибки</description>
    </items>
    <items>
      <name>СозданиеПожелания</name>
      <description>Создание пожелания</description>
    </items>
    <items>
      <name>СорванСрокОбработки</name>
      <description>Сорван срок обработки</description>
    </items>
    <items>
      <name>СорванСрокРеакции</name>
      <description>Сорван срок реакции</description>
    </items>
    <items>
      <name>СтартБизнесПроцесса</name>
      <description>Старт процесса</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

Certification/src/Catalogs/Консультации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Установить исключительную управляемую блокировку на массив переданных консультаций.
//
// Параметры:
//   Объекты - Массив - массив ссылок на консультации, или одна ссылка СправочникСсылка.Консультация.
//
Процедура ЗаблокироватьОбъекты(Объекты) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	Если ТипЗнч(Объекты) = Тип("Массив") Тогда
		Для каждого Консультация Из Объекты Цикл
			
			Если ТипЗнч(Объекты) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда 
				Продолжить;
			КонецЕсли;
			
			ЭлементБлокировки = Блокировка.Добавить("Справочник.Консультации");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Консультация);
		КонецЦикла;
	Иначе	
		Если ТипЗнч(Объекты) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;	
		ЭлементБлокировки = Блокировка.Добавить("Справочник.Консультации");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Объекты);
	КонецЕсли;
	
	Блокировка.Заблокировать();
	
КонецПроцедуры

// Возвращает форматированное описание консультации.
//
// Параметры:
//  Ссылка - СправочникСсылка.Консультации - консультация, по которой нужно получить описание.
// 
// Возвращаемое значение:
//  ФорматированныйДокумент - описание консультации.
//
Функция ФорматированноеОписание(Ссылка) Экспорт
    
    РеквизитыКарточки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Наименование, ОписаниеХранилище");
			
    Возврат РеквизитыКарточки.ОписаниеХранилище.Получить();
    
КонецФункции

// Возвращает вид события создания объекта.
//
Функция ВидСобытия_Создание() Экспорт
	
    Возврат Справочники.ВидыБизнесСобытий.СозданиеКонсультации;	
	
КонецФункции

// Возвращает вид события изменения объекта.
//
Функция ВидСобытия_Изменение() Экспорт
	
    Возврат Справочники.ВидыБизнесСобытий.ИзменениеКонсультации;	
	
КонецФункции

// Возвращает вид события перенаправления объекта.
//
Функция ВидСобытия_Перенаправление() Экспорт
	
    Возврат Справочники.ВидыБизнесСобытий.ПеренаправлениеКонсультации;	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Проверяет, подходит ли объект к шаблону бизнес-процесса
//
Функция ШаблонПодходитДляАвтозапускаБизнесПроцессаПоОбъекту(ШаблонСсылка, ПредметСсылка, Подписчик, ВидСобытия, Условие) Экспорт
	
	Возврат БизнесСобытия.ШаблонПодходитДляАвтозапускаБизнесПроцессаПоКарточке(ШаблонСсылка, 
		ПредметСсылка, Подписчик, ВидСобытия, Условие);
	
КонецФункции

#КонецОбласти

#КонецЕсли
